#include<stdio.h>

int main(){
    char X[100];    //設定字元陣列
    int s[4] = {0}; //設定整數陣列

    printf("輸入一字串:"); //輸出提示字
    scanf("%s", X);        //輸入字串

    for(int i=0; X[i]!='\0'; i++){
        if(X[i]>=33 && X[i]<=47){s[3] += 1;}   //判斷符號
        if(X[i]>=58 && X[i]<=64){s[3] += 1;}   //判斷符號
        if(X[i]>=91 && X[i]<=96){s[3] += 1;}   //判斷符號
        if(X[i]>=123 && X[i]<=126){s[3] += 1;} //判斷符號

        if(X[i]>=48 && X[i]<=57){s[2] += 1;}   //判斷數字

        if(X[i]>=65 && X[i]<=90){s[0] += 1;}   //判斷大寫字母

        if(X[i]>=97 && X[i]<=122){s[1] += 1;}  //判斷小寫字母

    }

    printf("大寫:%d\n小寫:%d\n數字:%d\n符號:%d", s[0], s[1], s[2], s[3]); //輸出結果
}
