#include<stdio.h>
/*
t010
*/
int main(){
    int H, M, S ,T, h, m; //設定變數:H小時,M分鐘,S秒,h m暫存

    printf("輸入 小時 分鐘 秒數 移動時區數量:"); //輸出提示字
    scanf("%d %d %d %d", &H, &M, &S, &T);        //輸入時間

    h = (90*T)/60; //計算經過幾小時
    m = (90*T)%60; //計算經過幾分鐘

    M += m;      //計算分鐘
    if(M<0){     //如果不夠就向小時借位
        H -= 1;
        M += 60;
    }
    if(M>=60){   //如果大於60就向小時進位
        H += 1;
        M -= 60;
    }

    H += h;
    if(H<0){     //如果不夠就借位
        H += 36;
    }
    if(H>=36){   //如果大於36就向小時進位
        H -= 36;
    }

    if(H<10){   //判斷H是否為個位數
        printf("0%d:", H); //是:輸出時前方多一個0
    }
    else{
        printf("%d:", H);
    }
    if(H<10){   //判斷M是否為個位數
        printf("0%d:", M); //是:輸出時前方多一個0
    }
    else{
        printf("%d:", M);
    }
    printf("%d", S);
}

